Revit 2027 API
MEPSystemType.LineColor Property
 Indicates the color that should override the line color for all components in the system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color LineColor { get; set; }
Public Property LineColor As Color
	Get
	Set
public:
property Color^ LineColor {
	Color^ get ();
	void set (Color^ value);
}
member LineColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
MEPSystemType Class
Autodesk.Revit.DB Namespace